<a href="https://colab.research.google.com/github/KevynGustavo/Aula_data_science/blob/main/Data_VIsualization_Seaborn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import seaborn 
import numpy as np

In [7]:
df = pd.read_csv("drive/MyDrive/Estudos_alura/tips.csv")
df

     total_bill   tip dessert   day    time  size
0         16.99  1.01      No   Sun  Dinner     2
1         10.34  1.66      No   Sun  Dinner     3
2         21.01  3.50      No   Sun  Dinner     3
3         23.68  3.31      No   Sun  Dinner     2
4         24.59  3.61      No   Sun  Dinner     4
..          ...   ...     ...   ...     ...   ...
239       29.03  5.92      No   Sat  Dinner     3
240       27.18  2.00     Yes   Sat  Dinner     2
241       22.67  2.00     Yes   Sat  Dinner     2
242       17.82  1.75      No   Sat  Dinner     2
243       18.78  3.00      No  Thur  Dinner     2

[244 rows x 6 columns]

In [14]:
df = df.rename(columns={"day":"dia",
                        "time":"horario",
                        "size":"quantidade",
                        "total_bill":"conta_total",
                        "tip":"valor_gorjeta",
                        "dessert":"pediu_sobremesa"})
df.head()

   conta_total  valor_gorjeta pediu_sobremesa  dia horario  quantidade
0        16.99           1.01              No  Sun  Dinner           2
1        10.34           1.66              No  Sun  Dinner           3
2        21.01           3.50              No  Sun  Dinner           3
3        23.68           3.31              No  Sun  Dinner           2
4        24.59           3.61              No  Sun  Dinner           4

In [16]:
df.columns

Index(['conta_total', 'valor_gorjeta', 'pediu_sobremesa', 'dia', 'horario',
       'quantidade'],
      dtype='object')

In [23]:
df['dia'].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)